#假设一共有5个洞口围成一圈，小狐狸最初在其中一个洞口
#玩家每天可以打开一个洞口抓狐狸，狐狸在该洞口则抓捕成功
#否则只能第二天再来洞口洞口抓，但在玩家打开洞口前，狐狸可以跑到隔壁洞口
#如果在规定数次内抓到狐狸就提前结束游戏并提示抓到狐狸
#如果超过规定次数未抓到者推出游戏并提示抓捕失败
import random

#创建一个list，初值为5个0，表示5洞口无狐狸，当狐狸在某一洞口时赋值1
#5个洞口围成一圈，即第5个洞口接下来是第一个洞口
hole = [0,0,0,0,0]
#用t记录狐狸所在的洞口，假设最初狐狸在第一个洞口
t = 0
hole[t] = 1
print(hole)

#记录抓捕次数
c =1
#第一天玩家随机选取一个洞口抓狐狸
p = random.randint(0, 4)
print('玩家对下标为%d的洞口进行抓捕'%p)
if p == t:
    print('抓捕成功，共进行%d次' % c)
else:
    while(p!=t):
        #狐狸离开该洞口，赋值回0
        hole[t] = 0
        f = random.randint(0, 1)
        # 第二天狐狸跑到隔壁洞口
        if f == 0:
            t = (t + 1) % 5
            hole[t] = 1
            print(hole)
        else:
            t = (t + 4) % 5
            hole[t] = 1
            print(hole)
        #抓捕次数
        c=c+1
        # 玩家打开洞口p
        p = random.randint(0, 4)
        print('玩家对下标为%d的洞口进行抓捕'%p)
        if c>5:
            print('抓捕次数超过5次，抓捕失败')
            break
    else:
        print('抓捕成功，共进行%d次'%c)
